[  
   {  
      "nid":"1",
      "title":"A Victorian Marriage",
      "field_summary":"Matilda Catherine Maude Ward, heiress of Bangor Castle marries the 5th Baron Clanmorris John George Barry Bingham.",
      "field_content":"Matilda Catherine Maude Ward, heiress of Bangor Castle marries the 5th Baron Clanmorris John George Barry Bingham. The Binghams originated from County Mayo and brought considerable title to the marriage. Following her wedding breakfast Maude spoke fondly of Bangor and claimed that no other spot could compete with it, \"for it had been the home of her childhood and her youth\". The marriage was a fruitful one and 10 children were born between 1879 and 1896.\n",
      "field_timeline_date":"27th June 1878",
      "view_node":"view",
      "field_section":"1",
      "field_type":"7",
      "ImageTitle":"Lord and Lady Clanmorris",
      "ImageFileName":"Lord_and_Lady_Clanmorris.jpg",
      "ImageAltText":"Lord and Lady Clanmorris"
   },
   {  
      "nid":"60",
      "title":"Edward Barry Stewart Bingham is born",
      "field_summary":"John and Matildas third son, Edward Barry Stewart Bingham is born in Bangor Castle.",
      "field_content":"",
      "field_timeline_date":"26th July 1881",
      "view_node":"view",
      "field_section":"1",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"10",
      "title":"Married Women's Property Act",
      "field_summary":"​The passing of the Married Women's Property Act allowed women to have complete control over their personal property and fortune. This proved beneficial to Lady Clanmorris who was allowed to maintain the Ward family fortune after her husband had spent his own.",
      "field_content":"",
      "field_timeline_date":"1882",
      "view_node":"view",
      "field_section":"1",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"11",
      "title":"First Home Rule Bill introduced",
      "field_summary":"​Prime Minister William Ewart Gladstone introduced the first Home Rule Bill on the 8th of April. Whilst the Bill brought the issue of Home Rule to British politics for the first time, it was rejected by the House of Lords. Two separate Bills were to follow in later years.",
      "field_content":"",
      "field_timeline_date":"1886",
      "view_node":"view",
      "field_section":"1",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"12",
      "title":"School days",
      "field_summary":"Breaking the family tradition of attending Eton College, Barry travelled to Wales and joined the prestigious Arnold House, Llanddulas.",
      "field_content":"The school prepared young men for the medical profession, life in the military and the Royal Navy. Spending his weekdays in a uniform of grey flannel shirts, jerseys and a red cap, Barry was a slender child with a passion for sport. He loved his family horses as well as hockey and cricket.\n",
      "field_timeline_date":"1890",
      "view_node":"view",
      "field_section":"1",
      "field_type":"7",
      "ImageTitle":"School Ad",
      "ImageFileName":"school_ad (1).jpg",
      "ImageAltText":"School Ad"
   },
   {  
      "nid":"59",
      "title":"Parnell dies",
      "field_summary":"​Irish National League leader and Home Rule advocate; Charles Stewart Parnell dies in October. ",
      "field_content":"",
      "field_timeline_date":"1891",
      "view_node":"view",
      "field_section":"1",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"61",
      "title":"Naval College",
      "field_summary":"Following five years of education at Arnold House, Barry began his career with the Royal Navy serving on HMS Britannia.",
      "field_content":"As a young cadet he served two years aboard this training ship in Devon where a thick skin was necessary in all aspects of life on board. Fighting and bullying amongst cadets was common whilst strict examinations were necessary to gain entry and promotion. Barry was required to be skilled in geometry, English arithmetic, geography and navigation.\n",
      "field_timeline_date":"June 1895",
      "view_node":"view",
      "field_section":"1",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"13",
      "title":"Diamond Jubilee",
      "field_summary":"​26th June 1897 saw Queen Victoria marking 60 years on the throne. Her Diamond Jubilee was celebrated with a 6-mile long procession along the streets of London. Hundreds of thousands of spectators watched as the 'Queen of earthly Queens' passed in her state coach.",
      "field_content":"",
      "field_timeline_date":"1897",
      "view_node":"view",
      "field_section":"1",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"27",
      "title":"Diamond Jubilee of Queen Victoria celebrated",
      "field_summary":"",
      "field_content":"",
      "field_timeline_date":"1897",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"26",
      "title":"Admiral Sir John A. Fisher",
      "field_summary":"HMS Renown was built as a second- class pre dreadnought in the early 1890's and served as the flagship for the North America and West Indies Station and later the Mediterranean Fleet. ",
      "field_content":"She was responsible for carrying the commanding officer and presenting their flag. Whilst Barry was on board in 1898, the Commander in Chief was Vice- Admiral Sir John A. Fisher. The Admiral demanded a high standard of work from those on board. Officers were expected to join him in meetings discussing military tactics whilst juniors were encouraged to improve their efficiency. Fisher hosted many banquets and dances for dignitaries to improve diplomatic relations and emphasis the Royal Navy's dominance of the sea. Barry makes reference to several of these occassions.\n",
      "field_timeline_date":"1897",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"Admiral_John_a_Fisher.gif",
      "ImageAltText":""
   },
   {  
      "nid":"14",
      "title":"Sailing on HMS Renown",
      "field_summary":"After successfully passing his cadet examinations, Barry officially joins the Royal Navy as a 'Midshipman'.",
      "field_content":"Serving on HMS Renown a flagship for the Navy's Mediterranean fleet, he describes the worst aspect of life on board. The \"miserable job of coaling....of all exhausting, prolonged, filthy, noisy, abominable jobs, this is surely the very worst. It takes at least two days hard work thoroughly to clean the ship from the coal-dust that penetrates everywhere.\"\n",
      "field_timeline_date":"08th June 1897",
      "view_node":"view",
      "field_section":"1",
      "field_type":"7",
      "ImageTitle":"HMS Renown",
      "ImageFileName":"HMS_Renown_1897.jpg",
      "ImageAltText":"HMS Renown"
   },
   {  
      "nid":"2",
      "title":"Jubilee on HMS Renown",
      "field_summary":"Eighteen days after Barry's commissioning, HMS Renown also celebrated Queen Victoria's Jubilee.",
      "field_content":"Barry records the ships actions throughout the day; \"8.0 dressed ship 2 p.m. fired Royal salute of 21 guns. Prince of Wales in 'Victoria and Alberta' received assembled fleet. 4.15 p.m 'Victoria and Alberta' anchored on starboard beam. The Prince received the Foreign Admirals. 9.15 Fleet illuminations 11.35 Saluted Prince 21 guns.\"\n",
      "field_timeline_date":"26th June 1897",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"1897victoriadiamondjubileemedallionobv400.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"16",
      "title":"General duties",
      "field_summary":"As HMS Renown was not actively engaged in combat at this time, general activities and individual roles were strictly adhered to. ",
      "field_content":"On the 27th August 1897, Barry described his morning activities and the special visitors who joined them on board; \"9.10 a.m. Divisions, prayers, received fresh provisions. 12.30 cleaned upper decks for inspection. Princess Beatrice came on board, also Lord Salisbury.\" Following this visit, Prime Minister Salisbury appointed Fisher as British naval delegate to the first Hague Peace Convention in 1899.\n",
      "field_timeline_date":"27th July 1897",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"15",
      "title":"A talented artist",
      "field_summary":"During his time on board Bingham proved to be quite the talented artist.",
      "field_content":"His various sketches depicting the interior mechanics of HMS Renown show a skilled young man, keen to progress in his career. Copper sheathing was first introduced in the late 1750's to prevent damage to a ships hull from shipworm and marine weeds. Despite the expense, every ship in the Royal Navy's fleet were given copper sheathing by the late 1700's. This extended a ships life span and made them more reliable.\n",
      "field_timeline_date":"December 1897",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"28",
      "title":"Battle of Omdurman",
      "field_summary":"British and Egyptian troops led by Horatio Kitchener defeat Sudanese tribesmen led by Khalifa Abdullah al-Taashi, thus establishing British dominance in the Sudan on September 2 1898.",
      "field_content":"",
      "field_timeline_date":"1898",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"19",
      "title":"Annual rowing regatta",
      "field_summary":"",
      "field_content":"",
      "field_timeline_date":"16th March 1898",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"20",
      "title":"Torpedo Practice",
      "field_summary":"In order to keep every officer on board skilled and prepared for battle, regular torpedo and armament practice was encouraged. ",
      "field_content":"In 1898 HMS Renown consisted of four 10-inch guns, ten 6-inch guns, twelve 12-pounder guns, twelve 3-pounder guns, eight machine guns and five torpedo tubes.\n",
      "field_timeline_date":"05th September 1898",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"17",
      "title":"Celebrations on board",
      "field_summary":"The men on board also found plenty of time for fun as well as work.",
      "field_content":"In a journal entry from October, Barry describes the celebrations which took place after a days work; \"Star 2nd watch employed coaling ship with briquettes from dockyard lighter. Port Watch employed scrubbing canvas gear and as requisite. Celebrated 93rd Anniversary of Battle of Trafalgar.\" The British victory at Trafalgar in 1805 ensured that her Navy's dominance was never questioned again in the war with France or until the beginning of the Great War.\n",
      "field_timeline_date":"21st October 1898",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"29",
      "title":"Radio transmission",
      "field_summary":"Guglielmo Marconi successfully transmits a radio signal across the English Channel.",
      "field_content":"",
      "field_timeline_date":"1899",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"18",
      "title":"President Washingtons birthday",
      "field_summary":"During HMS Renown's time as flagship for the North America and West Indies Station, Barry discusses their recognition of Naval traditions.",
      "field_content":"On the 22nd February 1899 from 6.35 a.m, the crew \"dressed ship in honour of Washington. Landed small companies for drill. 12.0 saluted American flag with 21 guns. 4.0 p.m. evening quarters. Gave special leave to Starboard Watch.”\nGeorge Washington was the first President of the United States of America and was active during the American Revolution. The tradition of dressing a ship and firing a 21 gun salute became prominent in the early Nineteenth Century. It consisted of stringing international maritime flags and insignia from stemhead to masthead, from masthead to masthead and then down to the taffrail. The 21 gun salute was originally representative of each state in the Union; however, this symbology was abolished in 1843.\n",
      "field_timeline_date":"22nd February 1899",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"21",
      "title":"Royal Guests",
      "field_summary":"Turkish Admiral",
      "field_content":"",
      "field_timeline_date":"Autumn 1899",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"22",
      "title":"An evenings entertainment",
      "field_summary":"A dance that goes ahead",
      "field_content":"",
      "field_timeline_date":"Autumn 1899",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"24",
      "title":"Missing Officers",
      "field_summary":"Whilst Barry's experience as a midshipman was peaceful, it was not without tragedy.",
      "field_content":"On the 8th October 1899 he discusses an average Sunday morning on board; \"Performed divine Service at usual time also landed customary church parties.\" The day soon took a turn for the worst when \"2 Officers went out shooting on the Western washes about 11 am and no trace of them was found failing to return the same evening, it is feared they were swamped in their ship. Ship search parties are still employed looking for them.”\nThe Officers were never found and were not accounted for in Barry's later journals.\n",
      "field_timeline_date":"08th October 1899",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"30",
      "title":"Second Boer War",
      "field_summary":"Second phase: The British offensive of January to September 1900",
      "field_content":"With the sieges still continuing was compelled to send two more divisions plus large numbers of colonial volunteers. By January 1900 this would become the largest force Britain had ever sent overseas, amounting to some 180,000 men with further reinforcements being sought.\n",
      "field_timeline_date":"1900",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"23",
      "title":"Queen Victoria's Birthday",
      "field_summary":"Journal entry 1899-1901. Discussing Queen Victoria’s birthday.",
      "field_content":"",
      "field_timeline_date":"May 1900",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"31",
      "title":"Submarines",
      "field_summary":"The British Royal Navy's first submarine, Holland 1, is launched at Barrow-in-Furness in October 1901",
      "field_content":"",
      "field_timeline_date":"1901",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"63",
      "title":"From Midshipman to Sub-Lieutenant",
      "field_summary":"1901 proved a successful year in Barry's career. ",
      "field_content":"He was promoted on the 15th February from Midshipman to Acting Sub-Lieutenant and again to Sub-Lieutenant on the 15th March.\n",
      "field_timeline_date":"1901",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"62",
      "title":"The Caesars Hockey Cup",
      "field_summary":"Sporting events were very common amongst officers and midshipmen on board.",
      "field_content":"Sporting events were very common amongst officers and midshipmen on board. Already a keen sportsman, Barry passionately describes a hockey game from the 22nd January 1901; “Played a hockey match .v. the “Ocean” for Caesars Hockey Cup. We defeated them 6 goals to 0, after a poorish game.\"\nDespite their victory, the crew received devastating news later in the day. \"11.45 received a telegram to say that her Gracious Majesty Victoria Queen of Great Britain and Ireland had passed away, The ‘Canopus’ immediately fired 82 guns and afterwards the Baracca repeated the same. Experienced very bad weather.”\n",
      "field_timeline_date":"22nd January 1901",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"25",
      "title":"Death of Queen Victoria",
      "field_summary":"Journal entry 1899-1901, 22\/01\/1901. Received a telegram that Queen Victoria had passed away, immediately fired 8 guns. Were playing an important hockey match prior to the telegram, they won 6 goals to 0.",
      "field_content":"",
      "field_timeline_date":"22nd January 1901",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"64",
      "title":"The London Gazette",
      "field_summary":"Two short years later Barry was once again promoted.",
      "field_content":"The London Gazette newspaper proudly displayed his name amongst the Sub-Lieutenant to Lieutenant promotions.\n",
      "field_timeline_date":"30th June 1903",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"Barry_lieutenant_promotion-_london_gazette.png",
      "ImageAltText":""
   },
   {  
      "nid":"65",
      "title":"HMS Bulwark",
      "field_summary":"Serving as a Lieutenant on HMS Bulwark; the Mediterranean flagship of Captain Edward M. Phillpotts, Barry took a keen interest in weaponry specifically torpedoes.",
      "field_content":"He left his position on Bulwark on the 30th September 1904 to command unspecified torpedo boats.\n",
      "field_timeline_date":"30th September 1904",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"66",
      "title":"Becoming a Senior Officer",
      "field_summary":"Barry was promoted to Acting Commander aboard HMS Star.",
      "field_content":"His official title remained 'Lieutenant and Commander' for several years.\n",
      "field_timeline_date":"25th April 1905",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"67",
      "title":"HMS Stag",
      "field_summary":"Served on board HMS Stag as Lieutenant and Commander from the 5th October 1908- February 1911.",
      "field_content":"",
      "field_timeline_date":"1908",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"68",
      "title":"Lieutenant Commander",
      "field_summary":"Barry was officially commissioned the title 'Lieutenant Commander' on 30th June 1911. ",
      "field_content":"He was not promoted again until 1914 for his actions during the Great War.\n",
      "field_timeline_date":"30th June 1911",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"3",
      "title":"The Commissioning of H.M.S. “Invincible\"",
      "field_summary":"My new ship was a battle-cruiser of the Dreadnought type, sister ship of the Inflexible and Indomitable",
      "field_content":"A more hopeless-looking ship than the Invincible, as she appeared on the morning of August 3rd, I never wish to behold or to commission again. \nThe dockyard was in feverish activity. The noise was indescribable … the ship's company triumphed in this inferno of turmoil, din, and filth - despite ‘mateys’, electricians, foremen, and the rest of them - with such effect, that by the 12th the ship was stored, provisioned, coaled, and a speed trial had been successfully accomplished.\nIn my own case, I had the further duties of boarding-officer; and the burden of the midshipmen's discipline and education, both moral and intellectual, lay on my shoulders. Unfortunately for them - though they probably thought otherwise - their instruction was very intermittent owing to the exigencies of wartime”\n",
      "field_timeline_date":"01st August 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"HMS Invincible",
      "ImageFileName":"HMS_Invincible_(1907)_British_Battleship.jpg",
      "ImageAltText":"HMS Invincible"
   },
   {  
      "nid":"9",
      "title":"Britain Declares War on Germany",
      "field_summary":"",
      "field_content":"",
      "field_timeline_date":"04th August 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"4",
      "title":"The Battle of Heligoland Bight",
      "field_summary":"The affair was a walk-over; our light cruisers and destroyers distinguished themselves and had all the thrills of a fight on more or less even terms.",
      "field_content":"\"For the battle-cruisers, every one of whom let drive at the two light cruisers thus decoyed, the Koln and the Ariadne, the affair was a walk-over; on the other hand, our light cruisers and destroyers distinguished themselves and had all the thrills of a fight on more or less even terms. \nAt the same time, it was just the thing we wanted for our guns' crews, because it constituted a highly exhilarating battle practice, with real targets and real ammunition. It is unfair to say that there was any real reply, because the German ships, though they gallantly fought their guns to the last, were hopelessly outnumbered and outgunned, and the nearest thing we had was one German shell which fell some hundred yards short. We were, however, kept on the alert by submarines, two of which nearly succeeded in torpedoing us on two different occasions.”\n",
      "field_timeline_date":"28th August 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"Sinking of the Mainz",
      "ImageFileName":"1024px-Sinking_of_Mainz.jpg",
      "ImageAltText":"Sinking of the Mainz"
   },
   {  
      "nid":"5",
      "title":"The Grand Fleet Parade",
      "field_summary":"This ‘Grand Fleet Parade’ as we used to call it, had the primary object of discovering the enemy and forcing an action upon him.",
      "field_content":"Except when requisitioned for such special duties, the Invincible cruised in company with the other battle-cruisers in the North Sea. \nThis cruising meant nothing more than a three or four days jaunt… round those waters, visiting all likely latitudes where the enemy might be found; all the time carrying out manoeuvres, wherein the officers and men of all ships were being continually exercised in general gunnery and fighting efficiency.\n",
      "field_timeline_date":"September 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"Grand Fleet Parade Review",
      "ImageFileName":"review8.jpg",
      "ImageAltText":"Grand Fleet Parade Review"
   },
   {  
      "nid":"33",
      "title":"The Battle of the Falklands",
      "field_summary":"On a clear, sunny morning: “So great was the visibility, that on clearing the entrance of the harbour we were able at once to take the range of the enemy, the tops of whose masts and funnels were just above the horizon.”",
      "field_content":"Though the battle took place with a distance between the ships to allow gun fire, there was still an element of confusion. \n“At first I found it a little difficult to differentiate between the flash of the enemy's guns and one's own hits, but observation soon enlightened me on the fact that when you really strike home on a ship you see a little red glow, or in the case of lyddite a cloud of yellow smoke, suddenly appear.” \nEventually the Germans were fighting a losing battle: \n“…the solitary Gneisenau fought a losing fight for nearly two hours. Admiral Sturdee in his report says: \"At 4.47 the Gneisenau was hit severely. At 5.8 pm she was evidently in serious straits, and her fire slackened very much. Three ships — Invincible, Inflexible, Carnarvon— were concentrating on her from different bearings. At 5.15 she hit the Invincible; this was her last effective effort.\" \nBy 6 the fight was over and the British collected the survivors who: \n“running over the uppermost side, threw themselves into the water, while the British ships steamed up at full speed to the spot, a few minutes ago the cradle of a proud ship, and now only marked by oil, wreckage, and masses of struggling humanity. Every available boat was lowered, and while the Invincible and Inflexible each picked up 108 and sixty-two survivors respectively, the Carnarvon— who had by now joined up—saved twenty. The survivors included the commander of the Gneisenau and about fifteen officers.” \n“I went away in one of the cutters and succeeded in picking up about forty survivors, most of them in a wounded condition, and all in various stages of exhaustion; and small wonder! for the ship in her last stages must have been a very hell on earth. Anyhow, it was a gruesome business for the rescuers.” \nOf the other ships: \n“…the Glasgow and Cornwall hunted the Leipzig, the Kent chased the Nurnberg, while with the advantages of speed and a good start, the Dresden got clear away. Very different was the fate of the Leipzig and Nurnberg, who were both sunk with colours flying, after a stern chase and gallant resistance”.\n",
      "field_timeline_date":"08th December 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"34",
      "title":"After the Victory",
      "field_summary":"No words can paint the delirious joy manifested by the inhabitants of the Falkland Islands when they heard the good news. Nor were they lacking in giving vent to what they felt; not only in words, but in unlimited quantities of flowers and fruit. In return, we presented them with a souvenir in the shape of a piece of our shattered steel mast, burnished and mounted on oak with a suitable inscription underneath.",
      "field_content":"",
      "field_timeline_date":"09th December 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"35",
      "title":"After the Victory",
      "field_summary":"",
      "field_content":"“Saturday, December 31st, 1914; the day of my engagement to be married; and the day that His Majesty honoured me with the most coveted of all decorations, stand together and stamp themselves vividly as the three most eventful landmarks of my life. These are times when a man rises above his ordinary self: when one seems to soar above the ordinary world and to be treading on the very air: when perhaps – ‘Our souls have sight of that immortal sea\nWhich brought us hither’.” “That same evening (December 31st) we received the half-yearly promotions by wireless and learned that Lieut.-Commander Danreuther and myself were safely over the enormous gap that separates lieutenant from commander. It is no exaggeration to describe this step as the most critical moment in a naval officer's career… it is rare that two lieutenant-commanders of the same ship receive their promotion simultaneously.”\n",
      "field_timeline_date":"31st December 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"36",
      "title":"Start of the Gallipoli Campaign",
      "field_summary":"Lasting until January 1916",
      "field_content":"",
      "field_timeline_date":"1915",
      "view_node":"view",
      "field_section":"3",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"37",
      "title":"Hunting submarines",
      "field_summary":"",
      "field_content":"“From the regular duties of patrolling and escorting a pleasant change was occasionally afforded by the excitement of a submarine hunt…If the submarine was sighted, but dived too quickly to be rammed or sunk by shell fire, the destroyers would congregate at this spot and start a systematic search, working in a series of squares or concentric circles, each gradually increasing in size.” “Looking back over those days, one seems to have lived in an atmosphere of continuous and prolonged strain. As if incessant running at high speed was not enough, there were the additional anxieties of fogs; entering and leaving harbours in the dark hours; manoeuvring in company of other ships without lights; and a responsibility of a different nature, though no less onerous, was the care of confidential matter, such as books, pamphlets, papers, charts, and their everlasting corrections.”\n",
      "field_timeline_date":"1915",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"32",
      "title":"Commanding the Hornet",
      "field_summary":"When Bingham arrived back in London, he was advised that his ship was not yet ready. The Admiralty: “…recommended a little leave, to be devoted to foxhunting. More wholesome advice was never given, and the prospect of spending a few weeks with friends and relations in a hunting centre much patronized by Oxford undergraduates was brilliant to one who had worked off the initial stages of stiffness in a few days with the Marques de Marzala's—I had almost written ‘with Senor Pablo Larios'’—sporting pack.”",
      "field_content":"One morning “…carelessly turning over the pages of the Morning Post, I read, not without mixed feelings, my own name followed by the apparently cryptic phrase—\" To Woolwich for Hornet” In plain English, I had been given command of the destroyer Hornet, herself attached to the parent ship Woolwich.” \n“They told me that the Hornet was a fine ocean-going destroyer of 850 tons, belonging to the 1st Flotilla based at Harwich; and further that my appointment carried with it not only the command of the ship, but also that of a division of four destroyers of which the Hornet was the leader…I was reminded that in dropping into such a good command I was extremely fortunate.” \nThough he still made enquiries about his M-Class destroyer which he was informed would be finished soon (it would prove to be another 15 months!). Bingham made his way to Harwich where he “…arrived on board in time to take over command after lunch on Friday, February 12th, 1915.” \nBingham made his cursory examination and found the Hornet to be “an excellent craft of her class”, reportedly easy to handle and a crew of 70.\n",
      "field_timeline_date":"12th February 1915",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"38",
      "title":"Commanding the Nestor",
      "field_summary":"",
      "field_content":"In April 1916 the first M-class destroyers appeared. “In the third batch of the newcomers was my new command, the Nestor, by whose appearance on April 30th their Lordships' promise and my own ambition found a realization.” “The whole of May was spent doing various exercises in the outer parts of the Firth of Forth, with the object of familiarizing officers and men with their new destroyers. While the engine room department was every day acquiring what can only be learned from new engines by careful observation, the torpedo staff and gunnery ratings were busy in their respective duties.” These ships were to be officially called the 13th Flotilla.\n",
      "field_timeline_date":"30th April 1916",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"39",
      "title":"Moving out",
      "field_summary":"“Things seemed as peaceful as could be on the afternoon of Tuesday, May 30th, when Maurice Bethell and I went ashore for a round of golf, at Bruntsfield near Edinburgh. After a thoroughly enjoyable game over this course …we adjourned for tea to ‘Rospletha’ —the little house I had rented on the side of the links—and then found our way down to Queensferry Pier at the regulation hour of 6 pm, in order to catch the routine boat.",
      "field_content":"",
      "field_timeline_date":"30th May 1916",
      "view_node":"view",
      "field_section":"4",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"41",
      "title":"Preparing to Abandon Ship",
      "field_summary":"“Of what was in store for us there was now not the vestige of a doubt, and the problem was, how to keep all hands occupied for the few minutes that remained before the crash must come. While the sub-lieutenant and myself were \"ditching” all charts, confidential books, and documents, the first lieutenant and the men were executing my orders in providing biscuit and water for the boats; lowering these to the water's edge; hoisting out Carley floats; and generally preparing for the moment when we should be obliged to leave the ship. These orders were rapidly executed, and there was still time on our hands; for nothing had as yet happened.”",
      "field_content":"",
      "field_timeline_date":"31st May 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"42",
      "title":"The Final Attack",
      "field_summary":"To have answered any one of our numerous assailants would have been as effective as the use of a peashooter against a wall of steel…It was a matter of two or three minutes only before the Nestor, enwrapped in a cloud of smoke and spray, the centre of a whirlwind of shrieking shells, received not a few heavy and vital hits, and the ship began slowly to settle by the stern and then to take up a heavy list to starboard.",
      "field_content":"",
      "field_timeline_date":"31st May 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"43",
      "title":"The End of the Nestor",
      "field_summary":"In about three minutes, the destroyer suddenly raised herself into an absolutely perpendicular position, and thus slid down, stern first, to the bottom of the North Sea, leaving a quantity of oil and wreckage to mark the spot where she had last rested…we gave our gallant but cruelly short-lived Nestor three rousing cheers and sang ‘God Save the King'.",
      "field_content":"",
      "field_timeline_date":"31st May 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"44",
      "title":"Collected by the German Navy",
      "field_summary":"In about fifteen minutes' time we saw a division of German destroyers shoot out from the rear of the battle fleet and steam towards us at high speed. Rapidly closing, one of them picked us up and carried of our motor-boat as a prize; while another took the men off the Carley floats. Once aboard, the wounded were placed in the ward-room, the officers in the captain's cabin, and the rest of the men in the stokeholds and engine-rooms.”",
      "field_content":"",
      "field_timeline_date":"31st May 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"45",
      "title":"Interrogation",
      "field_summary":"“The captain of the destroyer, which turned out to be the S 15, sent for me and interviewed me on the bridge. He saw that I was wet through from my immersion, but never offered me a change of clothes. He interrogated me without gaining any information, and his manner all through was typically Prussian and discourteous. We were, however, fed until our arrival at Wilhelmshaven the following evening.”",
      "field_content":"",
      "field_timeline_date":"31st May 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"40",
      "title":"The Battle",
      "field_summary":"Eight destroyers of the 13th Flotilla … with two of the 10th and two of the 9th Flotilla, having been ordered to attack the enemy with torpedoes when opportunity offered, moved out at 4.15pm simultaneously with a similar movement on the part of the enemy",
      "field_content":"“They intercepted an enemy force consisting of a light cruiser and fifteen destroyers. A fierce engagement ensued at close quarters, with the result that the enemy were forced to retire on their battle-cruisers, having lost two destroyers sunk and having their torpedo attack frustrated. . . . \n\"Nestor, Nomad, and Nicator, gallantly led by Commander the Hon. Edward B. S. Bingham, of Nestor, pressed home their attack on the battle-cruisers and fired two torpedoes at a range of 6,000 and 5,000 yards, being subjected to a heavy fire from the enemy and secondary armament.\n",
      "field_timeline_date":"31st May 1916",
      "view_node":"view",
      "field_section":"4",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"46",
      "title":"Counting the Cost",
      "field_summary":"The injured men were transferred to hospital. Bingham stated: “Our casualties were: killed, two officers and five men; seriously wounded, three; wounded, six; and the Nomad had even lower figures to show. In our case such few casualties were due to the fact that the German shells had in the majority of cases struck the Nestor in the after-part of the ship, while the men were almost exclusively forward all the time.”",
      "field_content":"",
      "field_timeline_date":"01st June 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"47",
      "title":"Captivity",
      "field_summary":"“Four days later a chance visit from representatives of the American Embassy enabled us to communicate to relatives news of our safety, which news was published in England on Saturday, June 10th. In ten days' time all the British prisoners of war, naval and military, were moved from Mainz to Friedburg in Hessen, and after a stay of nine and a half months, a third of the above, including the writer, were transferred to Augustabad, Neubrandenburg.”",
      "field_content":"",
      "field_timeline_date":"10th June 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"48",
      "title":"Return to Bangor",
      "field_summary":"",
      "field_content":"",
      "field_timeline_date":"Autumn 1918",
      "view_node":"view",
      "field_section":"6",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"49",
      "title":"Council Recognition",
      "field_summary":"",
      "field_content":"",
      "field_timeline_date":"Spring 1919",
      "view_node":"view",
      "field_section":"6",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"50",
      "title":"Church Recognition",
      "field_summary":"",
      "field_content":"",
      "field_timeline_date":"Spring 1919",
      "view_node":"view",
      "field_section":"6",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"51",
      "title":"Victoria Cross Letter",
      "field_summary":"",
      "field_content":"",
      "field_timeline_date":"Summer 1919",
      "view_node":"view",
      "field_section":"6",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"52",
      "title":"Victoria Cross",
      "field_summary":"",
      "field_content":"",
      "field_timeline_date":"Summer 1919",
      "view_node":"view",
      "field_section":"6",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   }
]