[  
   {  
      "nid":"1",
      "title":"A Victorian Marriage",
      "field_summary":"Matilda Catherine Maude Ward, heiress of Bangor Castle marries the 5th Baron Clanmorris John George Barry Bingham.",
      "field_content":"The Binghams originated from County Mayo and brought considerable title to the marriage. Following her wedding breakfast Maude spoke fondly of Bangor and claimed that no other spot could compete with it: \"for it had been the home of her childhood and her youth\". The marriage was a fruitful one with ten children born between 1879 and 1896.",
      "field_timeline_date":"27th June 1878",
      "view_node":"view",
      "field_section":"1",
      "field_type":"7",
      "ImageTitle":"Lord and Lady Clanmorris",
      "ImageFileName":"marriage.jpg",
      "ImageAltText":"Lord and Lady Clanmorris"
   },
   {  
      "nid":"60",
      "title":"Edward Barry Stewart Bingham is born",
      "field_summary":"John and Matildas third son, Edward Barry Stewart Bingham is born in Bangor Castle.",
      "field_content":"",
      "field_timeline_date":"26th July 1881",
      "view_node":"view",
      "field_section":"1",
      "field_type":"7",
      "ImageTitle":"Bangor Castle",
      "ImageFileName":"NDM00301.jpg",
      "ImageAltText":"Bangor Castle"
   },
   {  
      "nid":"10",
      "title":"Married Women's Property Act",
      "field_summary":"​The passing of the Married Women's Property Act allowed women to have complete control over their personal property and fortune. This proved benficial to Lady Clanmorris who was allowed to maintain the Ward family fortune after her husband had spent his own.",
      "field_content":"",
      "field_timeline_date":"1882",
      "view_node":"view",
      "field_section":"1",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"11",
      "title":"First Home Rule Bill introduced",
      "field_summary":"Prime Minister William Ewart Gladstone introduced the first Home Rule Bill on the 8th April. Whilst the Bill brought the issue of Home Rule to British politics for the first time, it was rejected by the House of Lords. Two seperate Bills were to follow in later years.",
      "field_content":"",
      "field_timeline_date":"1886",
      "view_node":"view",
      "field_section":"1",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"12",
      "title":"School days",
      "field_summary":"Barry attended Bangor Endowed School; now known as Bangor Grammar, until 1891. A musical child, he performed on the schools pianoforte at a prize distribution when he was only eight years old.",
      "field_content":"<p>At the age of 10 Barry broke the family tradition of attending Eton College and travelled to Wales to join the prestigious Arnold House, Llanddulas.</p><p>The school prepared young men for the medical profession, life in the military and the Royal Navy. Spending his weekdays in a uniform of grey flannel shirts, jerseys and a red cap, Barry was a slender child with a passion for sport. He loved his family horses as well as hockey and cricket.</p>",
      "field_timeline_date":"1890",
      "view_node":"view",
      "field_section":"1",
      "field_type":"7",
      "ImageTitle":"School Ad",
      "ImageFileName":"school_ad (1).jpg",
      "ImageAltText":"School Ad"
   },
   {  
      "nid":"59",
      "title":"Parnell dies",
      "field_summary":"​Irish National League leader and Home Rule advocate, Charles Stewart Parnell dies 6th October.",
      "field_content":"",
      "field_timeline_date":"1891",
      "view_node":"view",
      "field_section":"1",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"60",
      "title":"Grand Opera House Opens",
      "field_summary":"​​The Grand Opera House, Belfast is opened to the public. It was designed by the leading theatre architect of the time, Frank Matcham. The first season included burlesque acts, musical comedies, farces and melodramas.",
      "field_content":"",
      "field_timeline_date":"1895",
      "view_node":"view",
      "field_section":"1",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"61",
      "title":"Naval College",
      "field_summary":"Following five years of education at Arnold House, Barry began his career with the Royal Navy serving on HMS Britannia.",
      "field_content":"<p>As a young cadet he served two years aboard the training ship in Devon where a thick skin was necessary in all aspects of life on board. Fighting and bullying amongst cadets was common whilst strict examinations were necessary to gain entry and promotion.</p><p>Barry learned the required skills in geometry, English arithmetic, geography and navigation.</p>",
      "field_timeline_date":"June 1895",
      "view_node":"view",
      "field_section":"1",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"naval_college.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"13",
      "title":"Diamond Jubilee",
      "field_summary":"​26th June 1897 saw Queen Victoria marking 60 years on the throne. Her Diamond Jubilee was celebrated with a 6-mile long procession along the streets of London. Hundreds of thousands of spectators watched as the 'Queen of earthly Queens' passed in her state coach.",
      "field_content":"",
      "field_timeline_date":"1897",
      "view_node":"view",
      "field_section":"1",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
      {  
      "nid":"14",
      "title":"Sailing on HMS Renown",
      "field_summary":"After successfully passing his cadet examinations, Barry officially joined the Royal Navy as a 'Midshipman' on HMS Renown",
      "field_content":"<p>A flagship for the Royal Navy's North America and West Indies Station and later, the Mediterranean Fleet, he describes the worst aspect of life on board.</p><blockquote>The \"miserable job of coaling....of all exhausting, prolonged, filthy, noisy, abominable jobs, this is surely the very worst. It takes at least two days hard work thoroughly to clean the ship from the coal-dust that penetrates everywhere.\"</blockquote>",
      "field_timeline_date":"08th June 1897",
      "view_node":"view",
      "field_section":"1",
      "field_type":"7",
      "ImageTitle":"HMS Renown",
      "ImageFileName":"HMS_Renown_1897.jpg",
      "ImageAltText":"HMS Renown"
   },
   {  
      "nid":"26",
      "title":"Admiral Sir John A. Fisher",
      "field_summary":"HMS Renown was built as a second- class pre dreadnought in the early 1890's and served as the flagship for the North America and West Indies Station and later the Mediterranean Fleet. ",
      "field_content":"<p>She was responsible for carrying the commanding officer and presenting their flag. Whilst Barry was on board in 1898, the Commander in Chief was Vice- Admiral Sir John A Fisher. The Admiral demanded a high standard of work from those on board. Officers were expected to join him in meetings discussing military tactics whilst juniors were encouraged to improve their efficiency.</p><p>Fisher hosted many banquets and dances for dignitaries to improve diplomatic relations and emphasise the Royal Navy's dominance of the sea. Barry makes reference to several of these occassions.</p>",
      "field_timeline_date":"1897",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"dance_cancelled.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"2",
      "title":"Jubilee on HMS Renown",
      "field_summary":"Eighteen days after Barry's commissioning, HMS Renown also celebrated Queen Victoria's Jubilee.",
      "field_content":"<p>Barry records the ship's actions throughout the day:</p><blockquote><ul><li>8.0 dressed ship</li><li>2 p.m. fired Royal salute of 21 guns. Prince of Wales in 'Victoria and Alberta' received assembled fleet.</li><li>4.15 p.m 'Victoria and Alberta' anchored on starboard beam. The Prince received the Foreign Admirals.</li><li>9.15 Fleet illuminations</li><li>11.35 Saluted Prince 21 guns.</li></blockquote>",
      "field_timeline_date":"26th June 1897",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"jubilee.jpg",
      "ImageAltText":""
   },
    {  
      "nid":"16",
      "title":"General duties",
      "field_summary":"As HMS Renown was not actively engaged in combat at this time, general activities and individual roles were strictly adhered to. ",
      "field_content":"<p>On the 27th August 1897, Barry described his morning activities and the special visitors who joined them on board:</p><blockquote><ul><li>9.10 a.m. Divisions, prayers, received fresh provisions.</li><li>12.30 cleaned upper decks for inspection. Princess Beatrice came on board, also Lord Salisbury.</li></ul></blockquote><p>Following this visit, Prime Minister Salisbury appointed Admiral Fisher as British naval delegate to the first Hague Peace Convention in 1899.</p>",
      "field_timeline_date":"27th August 1897",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"princess_beatrice.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"15",
      "title":"A talented artist",
      "field_summary":"During his time on board Bingham proved to be a talented artist. His various sketches depicting the interior mechanics of HMS Renown show a skilled young man, keen to progress in his career.",
      "field_content":"Copper sheathing was first introduced in the late 1750s to prevent damage to a ships hull from shipworm and marine weeds. Despite the expense, every ship in the Royal Navy's fleet was given copper sheathing by the late 1700s. This extended a ship's life span and made them more reliable.",
      "field_timeline_date":"December 1897",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"sheathing_bolt.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"27",
      "title":"First Car",
      "field_summary":"Medical practitioner Dr John Colohan from Malahide, imported the first petrol driven car into Ireland, a Benz Velo Comfortable. It cost £175 and had a top speed of 30km per hour.",
      "field_content":"",
      "field_timeline_date":"1898",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"19",
      "title":"Annual rowing regatta",
      "field_summary":"Sporting competitions were an entertaining pastime on board HMS Renown. A Rowing Regatta was organised every year by the commanding Renown for every ship in her squadron. As well as creating friendly rivalries, the Regatta expelled built up energy from those on board.",
      "field_content":"<p>Barry recalls the days event:</p><blockquote><ul><li>Laid out mark buoys (etc) for racing courses.</li><li> Annual Rowing Regatta for Squadron took place.</li><li>6 p.m. Finished first half of races.</li></ul></blockquote>",
      "field_timeline_date":"16th March 1898",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"rowing_regatta.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"29",
      "title":"Radio transmission",
      "field_summary":"​On 6th July 1898 Guglielmo Marconi conducted a test radio telegraph transmission for Lloyd's insurers between Ballycastle, County Antrim, and Rathlin Island. The area was important as all shipping inward bound from America or Canada passed by Rathlin en route for Liverpool or Glasgow or Belfast.",
      "field_content":"",
      "field_timeline_date":"1898",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"20",
      "title":"Torpedo Practice",
      "field_summary":"In order to keep every officer on board skilled and prepared for battle, regular torpedo and armament practice was encouraged.",
      "field_content":" In 1898 HMS Renown consisted of four 10-inch guns, ten 6-inch guns, twelve 12-pounder guns, twelve 3-pounder guns, eight machine guns and five torpedo tubes.",
      "field_timeline_date":"05th September 1898",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"torpedo_practice.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"32",
      "title":"LGA Passed",
      "field_summary":"​​The Local Government (Ireland) Act was introduced which established popularly elected local authorities and gave qualified women a vote for the first time. The creation of the new councils had a significant effect on Ireland as it allowed local people to take decisions affecting themselves.",
      "field_content":"",
      "field_timeline_date":"1898",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"17",
      "title":"Celebrations on board",
      "field_summary":"The men on board also found plenty of time for fun as well as work.",
      "field_content":"<p>In a journal entry from October, Barry describes the celebrations which took place after a day's work:</p><blockquote>\"Star 2nd watch employed coaling ship with briquettes from dockyard lighter. Port Watch employed scrubbing canvas gear and as requisite. Celebrated 93rd Anniversary of Battle of Trafalgar.\"</blockquote><p>The British victory at Trafalgar in 1805 ensured that her Navy's dominance was never questioned again in the war with France.</p>",
      "field_timeline_date":"21st October 1898",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"celebrated_trafalgar.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x1",
      "title":"LGA Passed",
      "field_summary":"​​RMS Oceanic was launched by Harland and Wolff in Belfast on 14th January. The transatlantic ocean liner built for the White Star Line, was the largest ship in the world until 1901. At the outbreak of World War I  she was commissioned into Royal Navy service as an armed merchant cruiser.",
      "field_content":"",
      "field_timeline_date":"1899",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"18",
      "title":"President Washingtons birthday",
      "field_summary":"During HMS Renown's time as flagship for the North America and West Indies Station, Barry discusses their recognition of Naval traditions",
      "field_content":"<p>On the 22nd February 1899 from 6.35 a.m, the crew</p><blockquote>\"dressed ship in honour of Washington. Landed small companies for drill. 12.0 saluted American flag with 21 guns. 4.0 p.m. evening quarters. Gave special leave to Starboard Watch.\"</blockquote><p>George Washington was the first President of the United States of America and was active during the American Revolution. The tradition of dressing a ship and firing a 21 gun salute became prominent in the early Nineteenth Century.</p><p>It consisted of stringing international maritime flags and insignia from stemhead to masthead, from masthead to masthead and then down to the taffrail. The 21 gun salute was originally representative of each state in the Union, however, this symbology was abolished in 1843.</p>",
      "field_timeline_date":"22nd February 1899",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"presidents_day.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"21",
      "title":"Royal Guests",
      "field_summary":"Royal visitors were a regular on board HMS Renown and the traditional salute was to be expected.",
      "field_content":"<p>Barry records the event in his entry on Friday 1st September:</p><blockquote>\"Turkish Admiral visited ship. Saluted him with 13 guns.\"</blockquote>",
      "field_timeline_date":"1st September 1899",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"turkish_admiral.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"24",
      "title":"Missing Officers",
      "field_summary":"Whilst Barry's experience as a midshipman was peaceful, it was not without tragedy.",
      "field_content":"<p>On the 8th October 1899 he discussed an average Sunday morning on board:</p><blockquote>\"Performed divine Service at usual time also landed customary church parties.\"</blockquote><p>The day soon took a turn for the worst when:</p><blockquote>\"2 Officers went out shooting on the Western washes about 11 am and no trace of them was found failing to return the same evening, it is feared they were swamped in their ship. Ship search parties are still employed looking for them.\"</blockquote><p>The Officers were never found and were not accounted for in Barry's later journals.</p>",
      "field_timeline_date":"08th October 1899",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"two_officers_missing.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x2",
      "title":"Death of Queen Victoria",
      "field_summary":"Queen Victoria died in London on 22nd January. In Dublin theatres closed and the blinds were drawn at the General Post Office. Two days later Edward VII was proclaimed King of Ireland, in a state ceremony at Dublin Castle.",
      "field_content":"",
      "field_timeline_date":"1901",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"63",
      "title":"From Midshipman to Sub-Lieutenant",
      "field_summary":"1901 proved a successful year in Barry's career. ",
      "field_content":"His sketches and diary entries had been assessed and he was promoted on the 15th February from Midshipman to Acting Sub-Lieutenant and again to Sub-Lieutenant on the 15th March.",
      "field_timeline_date":"1901",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"port_plateau.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"62",
      "title":"The Caesars Hockey Cup",
      "field_summary":"Sporting events were very common amongst officers and midshipmen on board.",
      "field_content":"<p>Already a keen sportsman, Barry passionately describes a hockey game from 22nd January 1901:</p><blockquote>\"Played a hockey match .v. the “Ocean” for Caesars Hockey Cup. We defeated them 6 goals to 0, after a poorish game.\"</blockquote><p>The cup was named after HMS Caesar who purchased the silver trophy in 1900; HMS Renown was the first ship to win. Despite their victory, the crew received devastating news later in the day.</p><blockquote>\"11.45 received a telegram to say that her Gracious Majesty Victoria Queen of Great Britain and Ireland had passed away, The ‘Canopus’ immediately fired 82 guns and afterwards the Baracca repeated the same. Experienced very bad weather.\"</blockquote>",
      "field_timeline_date":"22nd January 1901",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"deck_hockey.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x3",
      "title":"St Patrick's Day becomes a holiday",
      "field_summary":"James O’Mara introduced a law to establish Saint Patrick's Day as a national holiday on 27th February. The law was warmly received but O'Mara later added a provision that public houses shut on 17th March after drinking got out of hand which was only repealed in the 1970s.",
      "field_content":"",
      "field_timeline_date":"1903",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"64",
      "title":"The London Gazette",
      "field_summary":"Two short years later Barry was promoted again.",
      "field_content":"The London Gazette newspaper proudly displayed his name amongst the Sub-Lieutenant to Lieutenant promotions. Prior to this Barry recalls playing on a Naval polo team in Malta. They won the \"Inter-regimental and Ships' 99 Annual Challenge Cup.\"",
      "field_timeline_date":"30th June 1903",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"009.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x4",
      "title":"Abbey Theatre opens",
      "field_summary":"​The Abbey Theatre was founded by WB Yeats and Lady Gregory. It opened to the public on Old Abbey Street, Dublin for the first time on 27th December. The bill consisted of three one-act plays, 'On Baile's Strand' and 'Cathleen Ní Houlihan' by Yeats and 'Spreading the News' by Lady Gregory.",
      "field_content":"",
      "field_timeline_date":"1904",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"65",
      "title":"HMS Bulwark",
      "field_summary":"Serving as a Lieutenant on HMS Bulwark, the Mediterranean flagship of Captain Edward M Phillpotts, Barry took a keen interest in weaponry, specifically torpedoes.",
      "field_content":"He left his position on Bulwark on the 30th September 1904 to command unspecified torpedo boats.",
      "field_timeline_date":"30th September 1904",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"hms_bulwark_1899.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x5",
      "title":"Drunkenness bill",
      "field_summary":"​​The Drunkenness (Ireland) Bill was debated in the British House of Commons on 7th July to offer legal protection for the husbands and wives of drunkards who squandered their family income. Irish Members of Parliament criticised the bill on the grounds that it was offensive.",
      "field_content":"",
      "field_timeline_date":"1905",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"66",
      "title":"Becoming a Senior Officer",
      "field_summary":"Barry was promoted to Acting Commander aboard HMS Star.",
      "field_content":"His official title remained 'Lieutenant and Commander' for several years.\n",
      "field_timeline_date":"25th April 1905",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"bingham_newspaper_cutting.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"67",
      "title":"HMS Stag",
      "field_summary":"Barry served on board HMS Stag as Lieutenant and Commander from the 5th October 1908 - February 1911.",
      "field_content":"",
      "field_timeline_date":"1908",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"hms_stag.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x6",
      "title":"First aircraft fklown in Ireland",
      "field_summary":"On 31st December Harry Ferguson became the first person to fly an aircraft in Ireland at Hillsborough. Born in Dromore, a noted engineer and inventor he designed and built the monoplane himself. Ferguson later developed the modern tractor and four wheel drive system.",
      "field_content":"",
      "field_timeline_date":"1909",
      "view_node":"view",
      "field_section":"2",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"68",
      "title":"Lieutenant Commander",
      "field_summary":"Barry was officially commissioned the title 'Lieutenant Commander' on 30th June 1911. ",
      "field_content":"He was not promoted again until 1914 for his actions during the Great War.\n",
      "field_timeline_date":"30th June 1911",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"005.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"69",
      "title":"​HMS Enchantress",
      "field_summary":"Barry served on board the Admiralty yacht, HMS Enchantress from 1913 - August 1914.",
      "field_content":"To record this key moment in his career, Barry carefully curated his own personal photograph album tracing his time on board. Various photographs show the future Prime Minister Winston Churchill and his guests during their leisure time and interacting with those serving on board.",
      "field_timeline_date":"April 1913",
      "view_node":"view",
      "field_section":"2",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"034.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"9",
      "title":"Britain Declares War on Germany",
      "field_summary":"Germany invaded Belgium in early August. In response Britain declared war on 4th August which marked the outbreak of World War I . Approximately 210,000 men from Ireland fought in the battle.",
      "field_content":"",
      "field_timeline_date":"1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"x3-1",
      "title":"​​HMS Invincible",
      "field_summary":"On the evening of Saturday 1st August 1914 Barry left his position on the Admiralty Yacht Enchantress and began his placement on HMS Invincible.",
      "field_content":"<p>Discussing his new Dreadnought battle-cruiser he states that the:<p><blockquote>\"big-gun armament constituted a revolution in the annals of the world's naval shipbuilding.\"</blockquote>",
      "field_timeline_date":" 01 August 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"HMS Invincible",
      "ImageFileName":"bingham_address_ship.jpg",
      "ImageAltText":"HMS Invincible"
   },
   {  
      "nid":"3",
      "title":"​A Commander's discipline",
      "field_summary":"As well as preparing the ship for sail, Lieutenant Commander Bingham also had the responsibility of training the young midshipmen on board.",
      "field_content":"<p>He discusses the task in 'Falklands, Jutland and the Bight':</p><blockquote><p>\"In my own case, I had the further duties of boarding-officer; and the burden of the midshipmen's discipline and education, both moral and intellectual, lay on my shoulders.</p><p>Unfortunately for them—though they probably thought otherwise—their instruction was very intermittent owing to the exigencies of wartime\"</p></blockquote>",
      "field_timeline_date":"August 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"HMS Invincible",
      "ImageFileName":"exercise_on_deck.jpg",
      "ImageAltText":"HMS Invincible"
   },
   {  
      "nid":"4",
      "title":"The Battle of Heligoland Bight",
      "field_summary":"The first naval battle of the Great War occurred on the 28th August 1914.",
      "field_content":"<p>The Battle of Heligoland Bight was designed by the Royal Navy as a means of attacking German patrols in the north-west German coast. The German High Seas Fleet lost 1,200 men as opposed to just 35 British sailors.</p><p>Barry described the German fleet as <blockquote>\"hopelessly outnumbered and outgunned, and the nearest thing we had was one German shell which fell some hundred yards short\"</blockquote>. <p>Barry went on to describe the battle as HMS Invincible's \"baptism of fire\".</p>",
      "field_timeline_date":"28th August 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"Sinking of the Mainz",
      "ImageFileName":"SMS_Mainz_sinking.jpg",
      "ImageAltText":"Sinking of the Mainz"
   },
   {  
      "nid":"5",
      "title":"The Grand Fleet Parade",
      "field_summary":"As well as fighting in war time battles, HMS Invincible was also engaged in day to day activities in the North Sea.",
      "field_content":"<p>Barry discusses her time spent \"cruising\" with the other battle-cruisers in the North Sea:</p><blockquote>\"This cruising meant nothing more than a three or four days jaunt… round those waters, visiting all likely latitudes where the enemy might be found; all the time carrying out manoeuvres, wherein the officers and men of all ships were being continually exercised in general gunnery and fighting efficiency\".</blockquote><p>These ships were known together as \"The Grand Fleet Parade\" whose sole aim was to discover the enemy and force an action.</p>",
      "field_timeline_date":"October 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"Grand Fleet Parade Review",
      "ImageFileName":"parade.jpg",
      "ImageAltText":"Grand Fleet Parade Review"
   },
    {  
      "nid":"x3-1i",
      "title":"Casement & Germany",
      "field_summary":"​Roger Casement sailed for Germany via America in October to recruit Germans as Allies but military recruitment and prosperity strengthened Irish ties to Britain.",
      "field_content":"",
      "field_timeline_date":"1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"x3-2",
      "title":"​​​The loss of HM Ships Good Hope and Monmouth",
      "field_summary":"Whilst serving in the North Sea, Barry regularly received news of colleagues who had lost their lives whilst serving in the Great War",
      "field_content":"<p>5th November 1914 brought the devastating news of HM Ships Good Hope and Monmouth's defeat during the battle of Coronel and the loss of Rear-Admiral Sir Christopher GFM Cradock. In the Royal Navy's first defeat in over 100 years, Barry remembers the day with great sadness:</p><blockquote>\"I had been shipmate with Captain Philip Francklin, M.V.O., of the Good Hope … and Admiral Cradock himself had been my commander in the Britannia during my cadetship...Among the many happy memories of those days, I cherish, as typical of the man, Cradock's words to me and they… always rung in my ears when risks were being run and dangers to life and limb encountered.\"</blockquote>",
      "field_timeline_date":" 05 November 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"von_spee_valparaiso.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x3-3",
      "title":"​​​​Naval polo team",
      "field_summary":"Barry's fond memories of his former Commander continue as he recalls playing under Admiral Cradock's leadership in a Naval polo team.",
      "field_content":"<blockquote>\"When a sub-lieutenant at Malta, in 1903, I had the privilege of playing under Cradock's leadership in the Naval polo team that won the 'Inter-regimental and Ships' 99 Annual Challenge Cup.\"</blockquote>",
      "field_timeline_date":"November 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"020.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x3-4",
      "title":"​​​​Leisure time",
      "field_summary":"Life on board contained happy occasions as well as sad moments.",
      "field_content":"<p>Barry describes the former during a right of passage game for new sailors:</p><blockquote>\"Each separate victim was seized and thrust into a chair on an upper portion of the deck, some six feet above the bath itself, towards which his back was turned. The face was then plentifully lathered from an enormous shaving-brush with a mixture of flour, tar, and other unpleasant ingredients; after which the victim, having been shaved with a razor of Gargantuan proportions, was tipped over backwards into the bath below. Here he was promptly caught by the ‘bears’ and other members of King Neptune's household, ducked thrice, passed along, and finally dismissed. A continuous roar of laughter accompanied these ceremonies\".</blockquote><p>Once the chosen individuals had taken part in the game they received a certificate which \"secured its bearer exemption on future occasions.\"",
      "field_timeline_date":"December 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"line_crossing_ceremony.jpg",
      "ImageAltText":""
   },
    {  
      "nid":"x3-5",
      "title":"​​​​German intelligence",
      "field_summary":"The Royal Navy remained confident in their naval dominance of the North Sea throughout 1914 and 1915.",
      "field_content":"<p>German Admiral Graf Maximilian Von Spee and his intelligence were heavily criticized by Barry before the Battle of the Falkland Islands in December 1914.</p><blockquote>\"On their side the Germans knew even less of the true state of affairs. Owing to the silencing of our wireless and the extraordinary secrecy of our movements, they were in complete ignorance, not only of our whereabouts, but of the two fundamental facts: that two modern battle-cruisers had been despatched from England, to join up with other cruisers; and secondly that this newly-formed squadron had been assembled for the express purpose of hunting them down and sinking them, jointly or severally.\"</blockquote>",
      "field_timeline_date":"December 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"von_spee.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"33",
      "title":"The Battle of the Falkland Islands",
      "field_summary":"Following Admiral Von Spee's success in sinking Admiral Cradock's flagship in November 1914, he attempted to raid the British radio and coaling stations at the Falkland Islands on 8th December 1914.",
      "field_content":"Admiral Jellicoe's battle-cruisers were waiting and a battle quickly ensued. Careful to remain out of reach of the German guns, HMS Inflexible was the first to open fire on Von Spee's ships from 16,500 yards away.",
      "field_timeline_date":"08th December 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"049.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"34",
      "title":"\"A clear sunny morning\"",
      "field_summary":"Barry describes the element of confusion during the battle due to the distance between opposing ships.",
      "field_content":"<blockquote>\"At first I found it a little difficult to differentiate between the flash of the enemy's guns and one's own hits, but observation soon enlightened me on the fact that when you really strike home on a ship you see a little red glow, or in the case of lyddite a cloud of yellow smoke, suddenly appears.\"</blockquote><p>As the afternoon went on it became clear that the German forces were fighting a \"losing battle\". By 6 p.m. the battle was over and British ships were ordered to collect the surviving German sailors. The Royal Navy suffered very few losses in comparison to the four warships and 2,000 lives lost from the German High Seas Fleet.</p>",
      "field_timeline_date":"08th December 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"germans_overhauled.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"35",
      "title":"​\"Delirious joy\"",
      "field_summary":"Following the battle, the Royal Navy were given gifts of gratitude from the inhabitants of the Falkland Islands.",
      "field_content":"<p>Barry discussed the \"delirious joy manifested by the inhabitants\" and the \"unlimited quantities of flowers and fruit\" they were presented with following the victory.</p><p>In response the Royal Navy<blockquote>\"presented them with a souvenir in the shape of a piece of our shattered steel mast, burnished and mounted on oak with a suitable inscription underneath.\"</blockquote>",
      "field_timeline_date":"08th December 1914",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"port_stanley_1905.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x3-2i",
      "title":"Irish sea a war zone",
      "field_summary":"​On 4th February, the German Admiralty declared the waters surrounding Great Britain and Ireland were within the seat of war and ships found in the area after 18th February would be destroyed. Four days later two steamers, the Downshire and Cambank were sunk and the Irish Sea was a \"war zone\"",
      "field_content":"",
      "field_timeline_date":"1915",
      "view_node":"view",
      "field_section":"3",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"37",
      "title":"​Board of enquiry",
      "field_summary":"February 1915 saw Barry gain command of a division of four destroyers and the lead ship, HMS Hornet.",
      "field_content":"<p>The division's war time duties included escorting fleets and protecting them from submarine attacks. As this activity was largely completed under the cover of darkness, accidents happened regularly.</p><p>Barry discussed an incident where he \"led his division dangerously close past a light cruiser\" and a collision occurred. Bingham was forced to explain the situation to his superior advisers during a board of enquiry.</p>",
      "field_timeline_date":"​12th February 1915",
      "view_node":"view",
      "field_section":"3",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"court_martial.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x4-1i",
      "title":"Easter Rising",
      "field_summary":"​From 24th - 29th April, Irish nationalists staged a rebellion in an attempt to establish an Irish Republic. Dublin bore the brunt of the attacks and damage, thousands were injured and hundreds killed. Less than a fortnight later 15 men who planned the Easter Rising were executed by firing squad.",
      "field_content":"",
      "field_timeline_date":"1916",
      "view_node":"view",
      "field_section":"4",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"39",
      "title":"The afternoon of 31st May 1916",
      "field_summary":"Bingham gained command of the M-Class destroyer, HMS Nestor in April 1916. The crew from HMS Hornet accompanied him and the month of May was spent familiarising themselves with their new destroyers.",
      "field_content":"<p>Following the clash of Admirals Beatty and Hipper and the beginning of the Battle of Jutland, HMS Nestor sighted the enemy at around 3.30 p.m.</p><p>Following his interaction with the German High Seas Fleet, Bingham described Nestor's final moments.</p><blockquote>\"It was just about 5 o'clock when two boilers were put out of action by direct hits. From the bridge I saw at once that something of the kind had happened. A huge cloud of steam was rising from the boiler-room, completely enshrouding the whole ship, and it was painfully apparent that our speed was dropping every second.\"</blockquote>",
      "field_timeline_date":"31st May 1916",
      "view_node":"view",
      "field_section":"4",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"nestor.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"41",
      "title":"​Farewell to HMS Nestor",
      "field_summary":"As HMS Nestor lay vulnerable to the German fleets, Bingham described the evacuation procedures",
      "field_content":"<blockquote>\"Of what was in store for us there was now not the vestige of a doubt, and the problem was, how to keep all hands occupied for the few minutes that remained before the crash must come. While the sub-lieutenant and myself were \"ditching\" all charts, confidential books, and documents, the first lieutenant and the men were executing my orders in providing biscuit and water for the boats; lowering these to the water's edge; hoisting out Carley floats; and generally preparing for the moment when we should be obliged to leave the ship.\"</blockquote><p>As the men filled the motor boat and floats:</p><blockquote>\"…there seemed to remain for me only the possibility of a place in the whaler. Bethell was standing beside me, and I turned to him with the question, \"Now where shall we go?\" His answer was only characteristic of that gallant spirit, \"To Heaven, I trust, sir!\"</p><p>At that moment he turned aside to attend to a mortally wounded signalman and was seen no more amidst a cloud of fumes from a bursting shell.\"</p></blockquote>",
      "field_timeline_date":"31st May 1916",
      "view_node":"view",
      "field_section":"4",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"nestor_disabled.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x4-2i",
      "title":"Lloyd George negotiations",
      "field_summary":"​​Between May and July David Lloyd George, the British Minister of Munitions, held the Lloyd George negotiations. He hoped to reach a settlement over Home Rule, breaking the political deadlock between the Irish Parliamentary Party and Unionists, allowing the government to focus on the war effort.",
      "field_content":"",
      "field_timeline_date":"1916",
      "view_node":"view",
      "field_section":"4",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"x5-1i",
      "title":"Daylight Savings Time",
      "field_summary":"​​Daylight saving time began for the first time as people put their clocks forward one hour throughout the United Kingdom on 21st May . However, Dublin remained behind by 25 minutes until 1st October. The purpose of the change was to reduce the number of evening hours thereby saving fuel.",
      "field_content":"",
      "field_timeline_date":"1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {    
      "nid":"42",
      "title":"​Picking up and capture",
      "field_summary":"Following HMS Nestor's sinking, Bingham and his crew were aboard their motor boat for a short period before they were approached by a division of German destroyers.",
      "field_content":"<blockquote>\"Rapidly closing, one of them picked us up and carried of our motor-boat as a prize; while another took the men off the Carley floats. Once aboard, the wounded were placed in the ward-room, the officers in the captain's cabin, and the rest of the men in the stokeholds and engine-rooms.\"</blockquote>",
      "field_timeline_date":"31st May 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"barry_prisoner_report.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"43",
      "title":"​\"Prussian and discourteous\"",
      "field_summary":"\"The captain of the destroyer, which turned out to be the S 15, sent for me and interviewed me on the bridge.\"",
      "field_content":"<p>\"He saw that I was wet through from my immersion, but never offered me a change of clothes. He interrogated me without gaining any information, and his manner all through was typically Prussian and discourteous.\"</p><p>\"We were, however, fed until our arrival at Wilhelmshaven the following evening.\"</p>",
      "field_timeline_date":"31st May 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"barry_interned.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"44",
      "title":"Hoping for rescue",
      "field_summary":"Following his interrogation, Bingham was left to rest in the Captain's quarters.",
      "field_content":"<blockquote>\"Lying on top of the captain's bunk in semidarkness, with clothes slowly drying on me, weary and feeling that one had reached the end, no wonder if I began to reflect about the immediate future. How was it all going to end?\"</blockquote><p>Barry spent much of the night hoping for a British ship to capture the German destroyer he was aboard. It soon became clear that he would remain a prisoner of war...</p><blockquote>\"And so the long-drawn torture of this ghastly night crept on until the first tinge of dawn found its way into the cabin, and with a silent prayer of heartfelt gratitude for the miraculous preservation of my life, I sank into sleep from sheer exhaustion.\"</blockquote>",
      "field_timeline_date":"31st May 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"reported_dead_with_photo.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"45",
      "title":"​Wilhelmshaven",
      "field_summary":"The next morning the ship's Sub-Lieutenant came to address the prisoners",
      "field_content":"<blockquote><p>\"At 7.30 am the sub-lieutenant of the destroyer came below, and after ordering some breakfast for us, announced that the battle was over and that the destroyer was shaping course for Wilhelmshaven. It was only natural to ask him which side had gained the victory.</p><p>His short but emphatic reply suggested a very slight acquaintance with the niceties of the English language. He simply said ‘I’ and pointed to his chest. At greater length he vaguely enumerated the ships lost by the British; of those lost by his own side he would admit to none.\"</p></blockquote>",
      "field_timeline_date":"1st June 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"wedding_pic_reported_dead.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"46",
      "title":"HMS Nestor's casualties",
      "field_summary":"\"Our casualties were: killed, two officers and five men; seriously wounded, three; wounded, six; and the Nomad had even lower figures to show.\"",
      "field_content":"<blockquote>\"In our case such few casualties were due to the fact that the German shells had in the majority of cases struck the Nestor in the after-part of the ship, while the men were almost exclusively forward all the time.\"</blockquote>",
      "field_timeline_date":"03rd June 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"barry_killed.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x5-2i",
      "title":"Kitchener Dies",
      "field_summary":"​​​Field Marshal Kitchener drowned on 5 June when HMS Hampshire sank west of the Orkney Islands. Born in Ballylongford, County Kerry, he was a senior British Army officer and colonial administrator who won fame for his imperial campaigns and played an important role in World War I before his death.",
      "field_content":"",
      "field_timeline_date":"1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"47",
      "title":"​The American Embassy",
      "field_summary":"The crew of HMS Nestor were originally reported dead following the battle. It wasn't until several days later that Barry's wife and family were informed of his survival.",
      "field_content":"<blockquote>\"Four days later a chance visit from representatives of the American Embassy enabled us to communicate to relatives news of our safety, which news was published in England on Saturday, June 10th\"</blockquote>",
      "field_timeline_date":"5th June 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"barry_alive.jpg",
      "ImageAltText":""
   },
    {  
      "nid":"x5-3i",
      "title":"Casement trial",
      "field_summary":"​​​Sir Roger Casement was tried in London for 'high treason'. Following the three day trial in June, Casement was sentenced to death and his knighthood, awarded for years of humanitarian work, stripped. On 3rd August he was hanged in Pentonville Prison.",
      "field_content":"",
      "field_timeline_date":"1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"x5-4i",
      "title":"Battle of the Somme",
      "field_summary":"​The Battle of the Somme began on 1st July. The 36th Ulster Division was part of Kitchener's 'New Army' which included many Ulster Volunteers. Over the two days of the battle, the Division lost some 5,500 men who were killed, wounded or missing.",
      "field_content":"",
      "field_timeline_date":"1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"x5-1",
      "title":"​Captivity",
      "field_summary":"Bingham wrote very little of his time in captivity and states that memories of unpleasant times are short lived and he looks back on his experience as a dream",
      "field_content":"<blockquote>\"Patience, fortitude, and cheerfulness are sought and struggled for daily; if achieved, what victory is more gratifying to a man? At the worst, is not the very effort of the struggle a fine and elevating thing in itself?\"</blockquote>",
      "field_timeline_date":"1st July 1916",
      "view_node":"view",
      "field_section":"5",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"060.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x6-1i",
      "title":"Irish Sea Tunnel proposed",
      "field_summary":"​Towards the end of September the suggestion of a tunnel under the Irish Sea between Scotland and Ireland was discussed. The idea proposed by the Glasgow Chamber of Commerce was popular but proved too costly to put into action especially given the financial constraints facing the country.",
      "field_content":"",
      "field_timeline_date":"1916",
      "view_node":"view",
      "field_section":"6",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"48",
      "title":"\"For Valour\"",
      "field_summary":"Whilst incarcerated, Barry was recommended for the highest military decoration. The Victoria Cross is issued to those who have shown \"valour\" under direct enemy fire.",
      "field_content":"<p>Admiral Sir John Jellicoe recommended Barry for the decoration in his dispatch of 15th September 1916 and the award was approved by King George V soon after.</p><p>This prestigious award remains one of only four naval Victoria Crosses awarded following the Battle of Jutland. Three were awarded posthumously.</p>",
      "field_timeline_date":"15th September 1916",
      "view_node":"view",
      "field_section":"6",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":"VC 360 goes here"
   },
   {  
      "nid":"x6-2i",
      "title":"Armistice signed",
      "field_summary":"​​At 5.00am on 11th November an armistice dictated by the Allies was signed by the Germans. Six hours later World War I officially ended. Definitive numbers are difficult to know but it is believed over 206,000 Irishmen served and over 35,000 were killed during the war.",
      "field_content":"",
      "field_timeline_date":"1918",
      "view_node":"view",
      "field_section":"6",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"50",
      "title":"Council Address",
      "field_summary":"Bingham's return home brought great pride and excitement to the people of Bangor.",
      "field_content":"<p>As representatives of the town, members of the Bangor Urban District Council presented Barry with a beautifully written address to mark the occasion.</p>",
      "field_timeline_date":"​20th November 1918",
      "view_node":"view",
      "field_section":"6",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":"Address images (PDF viewer?)"
   },
   {  
      "nid":"49",
      "title":"​Return to Bangor",
      "field_summary":"Following the end of the Great War, Bingham returned to his home town and was given a hero's welcome.",
      "field_content":"<p>He was met by cheering crowds and toured the town in an open carriage before being brought to his home, Bangor Castle.</p>",
      "field_timeline_date":"​23rd November 1918",
      "view_node":"view",
      "field_section":"6",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"NDM00222.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x6-3i",
      "title":"Spanish Influenza",
      "field_summary":"​​​The 1918-19 influenza pandemic, commonly known as the ‘Spanish Influenza’ was one of the most dramatic events of medical history. It came in three waves - June and October 1918 then February 1919, causing yet more devastation to Ireland which was trying to recover from the losses of the Great War.",
      "field_content":"",
      "field_timeline_date":"1919",
      "view_node":"view",
      "field_section":"6",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"51",
      "title":"​\"Falklands, Jutland and the Bight\"",
      "field_summary":"During his twenty-three months as a POW in Germany, Barry gave lectures and talks detailing his experiences of battle.",
      "field_content":" The lectures form the basis of his narrative entitled: 'Falklands, Jutland and the Bight by Commander The Hon. Barry Bingham V.C., R.N.' Published in July 1919 and dedicated to Barry's wife, Vera, the book became a respected first-hand account and revealed the \"courage and fortitude\" of Bingham and his crew.",
      "field_timeline_date":"July 1919",
      "view_node":"view",
      "field_section":"6",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"061.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x6-4i",
      "title":"CS Lewis",
      "field_summary":"​​​​CS Lewis published his first work 'Spirits in Bondage' under the pseudonym Clive Hamilton. Just returned from military service, the volume of poetry went largely unnoticed which upset the 20 year old but did not deter him from his passion for writing.",
      "field_content":"",
      "field_timeline_date":"1919",
      "view_node":"view",
      "field_section":"6",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   },
   {  
      "nid":"52",
      "title":"Later Life",
      "field_summary":"Barry remained in the Royal Navy following the end of the war.",
      "field_content":"He took command of HMS Nereus in July 1919 and proceeded to Captain ten further ships throughout his career. His daughter was born in 1921 and his son in 1923. Barry continued to reside at Bangor Castle for periods throughout his life but spent much of his retirement in England.",
      "field_timeline_date":"July 1919",
      "view_node":"view",
      "field_section":"6",
      "field_type":"7",
      "ImageTitle":"",
      "ImageFileName":"NDM00531.jpg",
      "ImageAltText":""
   },
   {  
      "nid":"x6-4i",
      "title":"Northern Ireland formed",
      "field_summary":"​​​​​Following the debates over Home Rule, an agreement was finally reached with the partition of Ireland. On 3rd May Northern Ireland was created and a new parliament was opened by George V in June 1921. The remainder of the island became the Irish Free State in 1922.",
      "field_content":"",
      "field_timeline_date":"1921",
      "view_node":"view",
      "field_section":"6",
      "field_type":"8",
      "ImageTitle":"",
      "ImageFileName":"",
      "ImageAltText":""
   }
]